Repository: Aly-exe/Agro
Catalog: lib/l10n/intl_*.arb
Languages: ar

# create_acc
source: Sign up
ar: إنشاء حساب

source: first name
ar: الاسم الاول

source: last name
ar: إسم العائله

source: email
ar: البريد الإلكتروني

source: password
ar: كلمة المرور

source: Sign up
ar: تسجيل بياناتي

# have_acc
source: Already have an account?
ar: لديك حساب ؟

source: Login
ar: تسجيل الدخول

source: Logout
ar: تسجيل الخروج

# first_name_please
source: enter first name
ar: قم بإدخال الاسم الاول

# last_name_please
source: enter last name
ar: قم بإدخال إسم العائله

# validName
source: enter valid name
ar: أدخل اسم صحيح

# email_please
source: enter your Email
ar: قم بإدخال البريد الالكتروني

# valid_email_please
source: enter valid email
ar: قم بإدخال بريد الكتروني صالح

# password_please
source: enter password
ar: قم بإدخال كلمة المرور

# successful_registration
source: successful Login You can now use App.
ar: تم التسجيل بنجاح

# failed_registration
source: failed registration please try again
ar: فشل التسجيل حاول مره اخري

source: Explore
ar: اكتشف

# main
source: Home
ar: الرئيسيه

source: Market
ar: المتجر

source: Setting
ar: الإعدادات

source: Feedbacks
ar: التقييمات

source: Rate Us
ar: قيمنا

# About
source: About us
ar: تعرف علينا

source: Create Now
ar: إنشاء حساب

# donot_have_account
source: Don't have an account ?
ar: ليس لديك حساب ؟

source: diagnose
ar: تشخيص

source: Crown Root Rot
ar: مصاب بتعفن الجذر

source: Healthy Wheat
ar: غير مصاب بأي مرض

source: Leaf Rust
ar: مصاب بصدأ الأوراق

# Wheat_Loose_Smut
source: Loose Smut
ar: مصاب بالتفحم

# explor_Main_title
source: All You need to know About Wheat
ar: كل ما تحتاج معرفته عن نبات القمح

# wheatmarket
source: Wheat
ar: القمح

# medicinemarket
source: Medicine
ar: الدواء

source: Name
ar: الإسم

# mobile
source: Mobile Number
ar: رقم الهاتف

source: Product Name
ar: اسم المنتج

source: Price
ar: السعر

# available
source: Available items
ar: العبوات المتاحه

source: Add
ar: إضافه

source: Pound
ar: جنيه

source: kilo
ar: كيلو

source: Edit Profile
ar: البيانات الشخصيه

# lang
source: Language
ar: اللغه

# Mode
source: Dark Mode(Soon)
ar: الوضع الليلي (قريبا)

# helpandsupport
source: Help & Support
ar: المساعده والدعم

source: Change Name
ar: تعديل الإسم

source: Change Password
ar: تعديل كلمة المرور

source: Change Profile Image
ar: تعديل صورة الملف الشخصي

# imageprofileerror
source: No Profile image selected to update
ar: خطأ! لم تختار صوره ليتم تعديل الصوره الحاليه

source: Edit
ar: تغيير

source: Update
ar: تحديث

# loginerror
source: incorrect Email or Password
ar: البريد الالكتروني او كلمة المرور غير صحيحه

# passerror
source: incorrect Password
ar: كلمة المرور غير صحيحه

source: Submit
ar: تأكيد

# cancel
source: Camcel
ar: رجوع

# logoutsure
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج ؟

source: yes
ar: نعم

source: No
ar: لا

source: close
ar: رجوع

# resetpassword
source: Forget Password?
ar: هل نسيت كلمة المرور؟

# Namesuccess
source: Change Name done Succecfully
ar: تم تعديل الإسم بنجاح

# Namefailed
source: Some Errors occured , please try Again
ar: فشل تعديل الإسم حاول مره أخري

# passsuccess
source: Password Changed Succecfully
ar: تم تعديل كلمة المرور بنجاح

# passfailed
source: Some Errors occured , please try Again
ar: فشل تعديل كلمة المرور حاول مره أخري

source: All Feedbacks
ar: التقييمات

# Nofeedback
source: No feedback available
ar: لا توجد تقيمات لعرضها

source: SKIP
ar: تخطي

# loosesmutdes
source: Wheat becomes unusually wet, resulting in squirrel swelling and distortion, causing significant crop losses to reduce the incidence of loose swelling, some preventive measures such as ensuring good pre-harvest dehydration of wheat, controlling insects and innate diseases, and avoiding storage in wet conditions.
ar: يحدث عندما يصبح القمح رطبًا بشكل غير طبيعي، مما يؤدي إلى انتفاخ السنابل وتشوهها، مسببًا خسائر كبيرة في المحصول للحد من حدوث التفخم الفضفاض، بعض التدابير الوقائية مثل التأكد من جفاف القمح بشكل جيد قبل الحصاد، والتحكم في الحشرات والأمراض الفطرية، وتجنب التخزين في ظروف رطبة.

# loosesmutmed
source: '''Tebconazole''' is a fungicide that can be used to treat loose coal in wheat, and is considered effective against disease-causing fungi. It has to be used according to the specific instructions and doses, and on the infected leaves and cables.
ar: '''التيبكونازول''' هو مبيد فطري يمكن استخدامه لعلاج التفحم الفضفاض في القمح، ويُعتبر فعالاً ضد الفطريات المسببة للمرض. يجب استخدامه وفقًا للتوجيهات والجرعات المحددة، وعلى الأوراق والسنابل المصابة بالمرض.

# CrownRotsAndRoots
source: Crown Rots & Root
ar: تعفن التاج والجذر

# CrownRootdes
source: The disease spreads to most farms immediately after the chilling, leading to the death of the infected seedlings, thus leading to a lack of production, especially if the time for planting a spasm is greater than that of the missing. The injury appears on some branches or on the entire plant, and is similar to the symptoms of water shortage
ar: انتشر هذا المرض في معظم المزارع بعد الشتل مباشرة مما يؤدي إلى موت الاشتال المصابة، وبالتالي يؤدي ذلك إلى قلة في الإنتاج وخاصة إذا تعدى الوقت المناسب لزراعة اشتال بدل المفقود. تظهر الإصابة على بعض الافرع أو على النبات بالكامل، وتتشابه مع اعراض نقص المياه

# CrownRootmed
source: '''Rezolx''' is used as an effective treatment to eliminate mold and is sprayed in soil every four weeks if the rot is severe and every six weeks if the rot is simple. The treatment must be sprayed in the evening where no sunshine reacts to chemicals and negatively affects the soil. Soil moisture must be checked periodically, especially before chemical treatments are sprayed
ar: استخدام مادة '''الريزولكس'''كعلاج فعال للقضاء على العفن ويتم رشه في التربة كل 4 أسابيع إذا كان التعفن شديد وكل 6 أسابيع إذا كان التعفن بسيط. يجب رش العلاج في المساء حيث لا وجوود لأشعة الشمس التي تتفاعل مع المواد الكيميائية وتؤثر بالسلب على التربة. يجب التأكد من رطوبة التربة بشكل دوري وخصوصًا قبل رش العلاجات الكيميائية

# leafrustdes
source: The most common echo disease in wheat. Symptoms depend on plant sensitivity and injury. The incidence is characterized by the appearance of many small red orange pulses into a brown bull spread over the surface of the leaves, and by the perfume of the leaf and the crust. It's up to 1.5 mm in diameter, slightly high and round to rectangular shape.
ar: أكثر أمراض الأصداء شيوعا فى القمح. تعتمد الأعراض على حساسية النبات وقابليتها للإصابه. وتتميز الإصابة بظهور العديد من البثور البرتقالية المحمره الصغيرة إلى بثور بنية اللون منتشرة على سطحى الأوراق، وغمد الورقة والقشور. فهي تصل إلى حجم 1.5 مم في القطر، مرتفعة قليلا ومستديرة إلى مستطيلة الشكل

# leafrustmed
source: Combination Products: Fungicides combining triazoles and strobilurins, like azoxystrobin + propiconazole, can offer broad-spectrum control.
ar: المنتجات المركبه: يمكن لمبيدات الآفات التي تجمع بين الترايزولات والستروبيلورينز، مثل أزوكسيستروبين + البروبيكونازول، أن توفر مكافحة طيفية واسعة النطاق.

# givefeedback
source: Give us Your feedback
ar: قيم التطبيق

# feedbackquestion
source: What's your opinion about APP ?
ar: ما رأيك في التطبيق؟

# feedbackcare
source: Care to share more about it?
ar: رأيك يهمنا علشان نقدر نطور من نفسنا

source: Your feedback
ar: اكتب تقييمك هنا

# feedbackwarning
source: Please enter your feedback
ar: رجاءً أكتب تقييمك

source: PUBLISH FEEDBACK
ar: إرسال التقييم

# feedbacksuccessmessage
source: Your review will be posted in the Application
ar: سنضع تقييمك في التطبيق

# feedbacksuccessmessage2
source: By making your voice heard, you help us improve
ar: شكرا علي تقييمك لنا سنطور من نفسنا لأجلك

source: Thanks !
ar: شكراً

source: English
ar: الإنجليزيه

source: Arabic
ar: العربيه

source: Select Language
ar: لغة التطبيق

# Cahngelanguage
source: Change Language
ar: تعديل اللغه

source: Send Code
ar: إرسال الكود

# email_sent
source: Email sent successfully , you can reset password now
ar: تم الإرسال بنجاح يمكنك الان تغيير كلمة المرور

# resetpasswordsentemailfailed
source: Error during send code please try again
ar: فشل الإرسال حاول مره اخري

# weightplease
source: please enter Weight
ar: أدخل الوزن

# mobileplease
source: please enter Mobile Number
ar: أدخل رقم الهاتف

# priceplease
source: please enter Price
ar: أدخل السعر

# nameplease
source: please enter your Name
ar: أدخل اسمك

# medicineplease
source: please enter Medicine Name
ar: أدخل اسم الدواء

source: package
ar: عبوه
